In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('datasets/titanic_dataset.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [6]:
df.shape

(1309, 12)

In [7]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   int64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   str
 4   Sex          1309 non-null   str
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   str
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    str
 11  Embarked     1307 non-null   str
dtypes: float64(2), int64(5), str(5)
memory usage: 122.8 KB

In [8]:
df['Sex'].value_counts()

Sex
male      843
female    466
Name: count, dtype: int64

In [9]:
pd.crosstab(df['Sex'], df['Survived'])

Survived    0    1
Sex
female     81  385
male      734  109

In [10]:
pd.crosstab(df['Sex'], df['Survived'], normalize='index')

Survived        0        1
Sex
female    0.17382  0.82618
male      0.87070  0.12930

In [11]:
pd.crosstab(df['Pclass'], df['Survived'], normalize='index')

Survived         0         1
Pclass
1         0.424149  0.575851
2         0.577617  0.422383
3         0.730606  0.269394

In [12]:
df.corr(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.020370,-0.038354,0.028814,-0.055224,0.008942,0.031428
Survived,-0.020370,1.000000,-0.264710,-0.053695,0.002370,0.108919,0.233622
Pclass,-0.038354,-0.264710,1.000000,-0.408106,0.060832,0.018322,-0.558629
Age,0.028814,-0.053695,-0.408106,1.000000,-0.243699,-0.150917,0.178740
SibSp,-0.055224,0.002370,0.060832,-0.243699,1.000000,0.373587,0.160238
Parch,0.008942,0.108919,0.018322,-0.150917,0.373587,1.000000,0.221539
Fare,0.031428,0.233622,-0.558629,0.178740,0.160238,0.221539,1.000000

In [19]:
#Display the last 10 rows of the dataset

df.tail(10)

# Print the number of rows and columns using .shape

df.shape

# Print the mean and median of the Fare column (note the correct capitalization)

df['Fare'].mean()
df['Fare'].median()

# Filter and display all passengers who are under 18 years old AND survived. How many are there?
under_18 = df[(df['Age'] < 18) & (df['Survived'] == 1)]
under_18

under_18.shape[0]

# Draw a pie chart showing the percentage of survived vs not survived passengers.
import matplotlib.pyplot as plt

survival_counts = df['Survived'].value_counts()
labels = survival_counts.index.astype(str)  # convert to strings
plt.pie(survival_counts.values, labels=labels, autopct='%1.1f%%')
plt.title('Survival Percentage')
plt.show()

ModuleNotFoundError: No module named 'matplotlib'

In [16]:
df.shape

(1309, 12)